Tekla.Structures.Analysis.AnalysisModelSeismicProperties
The AnalysisModelSeismicProperties class contains information related to analysis model seismic properties.

Tekla.Structures.Analysis.AnalysisModelSeismicProperties._AnalysisModelName
The name of the analysis model.

Tekla.Structures.Analysis.AnalysisModelSeismicProperties._SeismicParameters
The seismic parameters.

Tekla.Structures.Analysis.AnalysisModelSeismicProperties._SeismicIncludeSelfWeightMass
This indicates whether the selfweight was is included.

Tekla.Structures.Analysis.AnalysisModelSeismicProperties._SeismicMassLoadGroupIds
The identifier of the mass load group.

Tekla.Structures.Analysis.AnalysisModelSeismicProperties._SeismicMassLoadGroupFactors
The factors of the mass load group.

Tekla.Structures.Analysis.AnalysisModelSeismicProperties.SeismicParameters
The seismic parameters.

Tekla.Structures.Analysis.AnalysisModelSeismicProperties.SeismicIncludeSelfWeightMass
Indicates whether the selfweight is included.

Tekla.Structures.Analysis.AnalysisModelSeismicProperties.SeismicMassLoadGroupIds
The identifier of the mass load group.

Tekla.Structures.Analysis.AnalysisModelSeismicProperties.SeismicMassLoadGroupFactors
The factors of the mass load group.

Tekla.Structures.Analysis.AnalysisModelSeismicProperties.Modify(System.String)
Inserts the analysis model seismic properties.
The AnalysisModelName has to be set.
AnalysisModelName: The name of the analysis model.

Tekla.Structures.Analysis.AnalysisModelSeismicProperties.Select(System.String)
Selects the analysis model seismic properties.
The AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisModelSeismicProperties.ModifyInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisModelSeismicProperties.SelectInstance
DO NOT USE! For internal usage only!